{
  "architectures": [
    "DCFormer"
  ],
  "auto_map": {
    "AutoConfig": "configuration_dcformer.DCFormerConfig",
    "AutoModelForCausalLM": "modeling_dcformer.DCFormer"
  },
  "block_size": 4096,
  "bos_token_id": 1,
  "dim": 4096,
  "eos_token_id": 2,
  "head_dim": 128,
  "intermediate_size": 5632,
  "is_training": false,
  "mgate": true,
  "mgate_dim": 44,
  "model_type": "dcformer",
  "n_head": 32,
  "n_layer": 48,
  "n_local_heads": 32,
  "norm_eps": 1e-06,
  "prefill_pad": true,
  "q_chunk_size": 128,
  "query_wise": false,
  "rope_base": 500000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.46.3",
  "use_dcmha": true,
  "use_gradient_checkpointing": false,
  "use_qk_norm": true,
  "vocab_size": 152064,
  "window_size": 256,
  "window_type": "LGLL"
}
